rosetta-source/src/main/resources/available-samples/dtcc-samples/DDL_Exercise_SC3.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ ../../schemas/dtcc-11-0/OTC_Matching_11-0.xsd"
    xmlns:fpml="http://www.fpml.org/2010/FpML-4-9" xmlns:rm="OTC_RM_11-0"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mtc="OTC_Matching_11-0">
    <env:Header>
        <!-- CONFIDENTIAL AND PROPRIETARY All rights reserved Copyright 2003,2004,2005 The Depository Trust & Clearing Corporation By receipt and review of these materials, the recipient acknowledges and agrees that these materials are and shall remain, and be treated and maintained by any recipient, as confidential and as such may not be disclosed. Further, the recipient agrees that all copyright and other intellectual property rights in or relating to these materials are and shall remain the property of DTCC. -->
        <OTC_RM xmlns="OTC_RM_11-0">
            <Manifest>
                <TradeMsg>
                    <Activity>New</Activity>
                    <Status>Confirmed</Status>
                    <TransType>Exercise</TransType>
                    <ProductType>CreditDefaultSwapIndex</ProductType>
                    <Submitter>
                        <partyTradeIdentifier>
                            <fpml:partyReference href="DTCCDEMO0321"/>
                            <fpml:tradeId tradeIdScheme="TradeRefNbr">SP17_CDXSwaption_PARTYA_SC3</fpml:tradeId>
                            <fpml:tradeId tradeIdScheme="DTCCTradeId">20180216.1000188128</fpml:tradeId>
                            <fpml:tradeId tradeIdScheme="TradeRefNbrSupplement">SP17_CDXSUPTExercise_A</fpml:tradeId>
                            <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20180215.00007XXXXX</fpml:tradeId>
                        </partyTradeIdentifier>
                    </Submitter>
                    <ContraTradeId>
                        <partyTradeIdentifier>
                            <fpml:partyReference href="DTCCDEMO0456"/>
                            <fpml:tradeId tradeIdScheme="TradeRefNbr">SP17_CDXSwaption_PARTYB_SC3</fpml:tradeId>
                            <fpml:tradeId tradeIdScheme="DTCCTradeId">20180216.1000188128</fpml:tradeId>
                            <fpml:tradeId tradeIdScheme="TradeRefNbrSupplement">SP17_CDXSUPTExercise_B</fpml:tradeId>
                            <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20180215.00007XXXXX</fpml:tradeId>
                        </partyTradeIdentifier>
                    </ContraTradeId>
                </TradeMsg>
                <MsgId>MKREQ1f</MsgId>
            </Manifest>
            <Delivery>
                <RouteInfo>
                    <From>DTCCDEMOSUB1</From>
                    <To>DTCC</To>
                </RouteInfo>
                <RouteHist>
                    <Route>
                        <RouteAddress>www.requestoraddress.com</RouteAddress>
                        <ReceiveTime>2015-07-23T18:08:40.335-05:00</ReceiveTime>
                        <ReleaseTime>2015-07-23T18:08:40.335-05:00</ReleaseTime>
                    </Route>
                </RouteHist>
            </Delivery>
        </OTC_RM>
    </env:Header>
    <env:Body>
        <OTC_Matching xmlns="OTC_Matching_11-0">
            <Activity>New</Activity>
            <Status>Confirmed</Status>
            <WarehouseState>
                <WarehouseStatus>Submit</WarehouseStatus>
                <WarehousePositionType>Gold</WarehousePositionType>
            </WarehouseState>
            <Exercise>
                <partyTradeIdentifier>
                    <fpml:partyReference href="DTCCDEMO0321"/>
                    <fpml:tradeId tradeIdScheme="TradeRefNbr">SP17_CDXSwaption_PARTYA_SC3</fpml:tradeId>
                    <fpml:tradeId tradeIdScheme="DTCCTradeId">20180104.1000061231</fpml:tradeId>
                    <fpml:tradeId tradeIdScheme="TradeRefNbrSupplement">SP17_CDXSUPTExercise_A</fpml:tradeId>
                    <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20180215.00007XXXXX</fpml:tradeId>
                </partyTradeIdentifier>
                <ExerciseProvisions>
                    <ExerciseTradeDate>2015-07-15</ExerciseTradeDate>
                    <ExerciseEffectiveDate>2015-07-15</ExerciseEffectiveDate>
                    <ExerciseEventType>Cash</ExerciseEventType>
                    <ExercisedAmount>
                        <fpml:currency currencyScheme="http://www.fpml.org/ext/iso4217">USD</fpml:currency>
                        <fpml:amount>10000000</fpml:amount>
                    </ExercisedAmount>
                    <OutstandingNotionalAmount>
                        <fpml:currency currencyScheme="http://www.fpml.org/ext/iso4217">USD</fpml:currency>
                        <fpml:amount>0</fpml:amount>
                    </OutstandingNotionalAmount>
                </ExerciseProvisions>
                <payment>
                    <fpml:payerPartyReference href="DTCCDEMO0456"/>
                    <fpml:receiverPartyReference href="DTCCDEMO0321"/>
                    <fpml:paymentAmount>
                        <fpml:currency currencyScheme="http://www.fpml.org/ext/iso4217">USD</fpml:currency>
                        <fpml:amount>11000</fpml:amount>
                    </fpml:paymentAmount>
                    <fpml:adjustedPaymentDate>2015-07-20</fpml:adjustedPaymentDate>
                </payment>
                <party id="DTCCDEMO0321">
                    <fpml:partyId partyIdScheme="DTCC">DTCCDEMO0321</fpml:partyId>
                </party>
                <party id="DTCCDEMO0456">
                    <fpml:partyId partyIdScheme="DTCC">DTCCDEMO0456</fpml:partyId>
                </party>
            </Exercise>
        </OTC_Matching>
    </env:Body>
</env:Envelope>
